# !/usr/bin/env python
# -*-coding:utf-8 -*-
# @Time    : 2022/01/04 11:32
# @Author  : makabaka
# @Version : python3.9
# @File    : My_First

# print("HELLO WORlD")
# print('HELLO WORLD')
# print('''HELLO WORLD''')

"""
我他妈人麻了啊
一直重重复复学习
服了
这次一定要坚持下来
求求你了
"""

"""
/***
 *                    _ooOoo_
 *                   o8888888o
 *                   88" . "88
 *                   (| -_- |)
 *                    O\ = /O
 *                ____/`---'\____
 *              .   ' \\| |// `.
 *               / \\||| : |||// \
 *             / _||||| -:- |||||- \
 *               | | \\\ - /// | |
 *             | \_| ''\---/'' | |
 *              \ .-\__ `-` ___/-. /
 *           ___`. .' /--.--\ `. . __
 *        ."" '< `.___\_<|>_/___.' >'"".
 *       | | : `- \`.;`\ _ /`;.`/ - ` : | |
 *         \ \ `-. \_ __\ /__ _/ .-` / /
 * ======`-.____`-.___\_____/___.-`____.-'======
 *                    `=---='
 *
 * .............................................
 *          佛祖保佑             永无BUG
 */
"""
# my_name = 'CR'
#
# print(my_name)
#
# a = 2123156454
# print(a)
# print(type(a))

# a = 1
# b = 1.1
# print(type(a))
# print(type(b))

# Year = 21
# print("今年我的年龄是{%d}岁", Year)
# print("今年我的年龄是%d岁" % Year)

Name = 'CR'
Year = 21
print(f'我的名字是{Name},我今年{Year}')