# !/usr/bin/env python
# -*-coding:utf-8 -*-
# @Time    : 2022/01/10 10:28
# @Author  : makabaka
# @Version : python3.9
# @File    : list 

"""
    list(列表)的查找
    index()     找到返回下标，找不到报错
     count()     寻找该目标在这其中出现的次数
    len()       测量列表的长度
"""
# list1 = ['陈荣', '刘显涛', '王双润', '王双润']

# print(list1.index('王双润'))
# print(list1.index('周旭东'))
# print(list1.count('王双润'))
# print(len(list1))

"""
    判断一个数据在不在列表里面
    in          
    not in
"""

# list1 = ['陈荣', '刘显涛', '王双润', '王双润']

# print('陈' in list1)
# print('王双润' not in list1)

"""
    列表数据增加
    append(字符)函数 在列表的末尾添加数据
    extend(字符)函数 将数据拆分添加至列表
    insert(下标, 新字符)函数 在指定位置添加数据 
"""
# list1 = ['陈荣', '刘显涛', '王双润']

# list1.append('我是你爹')
# list1.extend('我是你爹')
# list1.insert(2, '我是你爹')

# print(list1)

"""
    数据的删除
    del 目标   或者  del (目标)   删除整体 也可以指定下标
    pop()函数  默认删除最后一个 可指定下标 pop返回被删除数据
    remove()函数  直接指定目标 '陈荣',删除第一个匹配项
    clear()函数  清空列表 
"""
list1 = ['陈荣', '刘显涛', '王双润', '陈荣']

# del (list1[0])
# print(list1)

# new_list1 = list1.pop(0)
# print(list1)
# print(new_list1)

# list1.remove('陈荣')
# print(list1)
#
# list1.clear()
# print(list1)

"""
    ******************************列表的修改******************************
    ********************************************************************
    ********************************************************************
    ********************************************************************
"""
# list1 = ['cr', 'cds', 'cs']

# 1. 对指定数据直接进行修改
# list1[0] = 'dsadadsadsa'
# print(list1)

# 2. 数据的逆置 reverse()
#
# list2.reverse()
# print(list2)             输出结果[7, 4, 9, 8, 5, 2, 1]

# 3. sort() 对数据进行排列 升序  降序
# list2 = [1, 2, 5, 8, 9, 4, 7]

# list2.sort()            # 默认升序
# print(list2)

# list2.sort(reverse=True)  # True 时候为降序
# print(list2)
#
# list2.sort(reverse=False) # False 时候为升序
# print(list2)


"""
    ******************************列表的复制******************************
    ********************************************************************
    ********************************************************************
    ********************************************************************
"""
# 1. copy() 函数
# list1 = [1, 2, 3, 4, 5]
# list2 = list1.copy()
# print(list1)
# print(list2)


"""
    *************************while 和 for的遍历**************************
    ********************************************************************
    ********************************************************************
    ********************************************************************
"""
list1 = ['陈荣', '刘显涛', '王双润', '陈荣']

# i = 0
#
# while i < len(list1):
#     print(list1[i])
#     i += 1
# .

# for i in list1:
#     print(i)


"""
    ******************************列表的嵌套******************************
    ********************************************************************
    ********************************************************************
    ********************************************************************
"""

# 过于简单  不进行讲解

"""
    ******************************列表的案例******************************
    ********************************************************************
    ********************************************************************
    ********************************************************************
"""
# 8个老师分配到三个办公室

import random
# 1. 准备数据
Teacher_Name = ['A1', 'A2', 'A3', 'A4', 'A5', 'A6', 'A7', 'A8']
Office = [[], [], []]

# 2. 分配老师
for name in Teacher_Name:
    Number = random.randint(0, 2)
    Office[Number].append(name)

i = 1
# 3. 验证是否分配成功
for office in Office:
    size = len(office)
    print(f'办公室{i}的人数是{size}')
    print(f'都有这些老师{office}')
    i += 1

